salal-m/pycom-micropython-sigfox/esp32/ftp/updater.c
    // Getting the offset of the current image in the flash
    if (boot_info.ActiveImg == IMG_ACT_FACTORY) {
        old_bin_offset = IMG_FACTORY_OFFSET;
    } else {
        old_bin_offset = (esp32_get_chip_rev() > 0 ? IMG_UPDATE1_OFFSET_8MB : IMG_UPDATE1_OFFSET_4MB);
    }

    ESP_LOGI(TAG, "Old_Offset: %d, Offset: %d, Size: %d, ChunkSize: %d, Chunk: %d\n",
             old_bin_offset, updater_data.offset, updater_data.size, updater_data.chunk_size, updater_data.current_chunk);
    ESP_LOGI(TAG, "BootInfoSize: %d, BootInfoActiveImg: %d\n",
             boot_info.size, boot_info.ActiveImg);

    // File format:
    //     0   8   "BSDIFF40"
    //     8   8   X
    //     16  8   Y
    //     24  8   sizeof(newfile)
    //     32  X   bzip2(control block)
    //     32+X    Y   bzip2(diff block)
    //     32+X+Y  ??? bzip2(extra block)
    // with control block a set of triples (x,y,z) meaning "add x bytes
    // from oldfile to x bytes from the diff block; copy y bytes from the
    // extra block; seek forwards in oldfile by z bytes".

    // Reading header of the patch file

    if (ESP_OK != updater_spi_flash_read(patch_offset, header, 32, false)) {
        ESP_LOGE(TAG, "Error while reading patch file header\n");
        goto return_status;
    }

    // Check for the appropriate magic
    if (memcmp(header, "BSDIFF40", 8) != 0) {
        ESP_LOGE(TAG, "Invalid header\n");
        goto return_status;
    }

    ESP_LOGI(TAG,"Header Verified\n");

    // Reading lengths from header
    bzctrllen = offtin(header + 8);
    bzdatalen = offtin(header + 16);
    newsize = offtin(header + 24);

    xtralen = patch_size - (32 + bzctrllen + bzdatalen);

    ESP_LOGD(TAG, "CtrlLen: %d, DataLen: %d, NewSize: %d, ExtraLen: %d\n", bzctrllen, bzdatalen, newsize, xtralen);

    if ((bzctrllen < 0) || (bzdatalen < 0) || (newsize < 0) || (xtralen < 0)) {
        ESP_LOGE(TAG, "Invalid Block Sizes CtrlLen: %d, DataLen: %d, NewSize: %d, ExtraLen: %d\n", bzctrllen, bzdatalen, newsize, xtralen);
        goto return_status;
    } else {
        const int FLASH_READ_WRITE_SIZE = 512;              // Number of bytes read/written to flash at a time

        uint16_t i = 0;
        unsigned char *out_buf = NULL;
        unsigned char *diff_ptr = NULL;
        unsigned char *xtra_ptr = NULL;
        unsigned char old_bin_buf[FLASH_READ_WRITE_SIZE];   // Buffer to read parts of old binary

        unsigned char *patch_buf;

        void *ctrl_strm = NULL;
        void *diff_strm = NULL;
        void *xtra_strm = NULL;

        int ctrl[3];                                        // Buffer to read control block values from the patch file (NOTE: Its value can be negative)
        int oldpos = 0;                                     // Read pointer for old binary
        int newpos = 0;                                     // Read pointer for the patched binary

        unsigned int ctrl_len, diff_len, xtra_len;
        int ret = 0;

        // Reading the complete patch file
        patch_buf = heap_caps_malloc(patch_size, MALLOC_CAP_SPIRAM);
        if (patch_buf == NULL) {
            ESP_LOGE(TAG, "Failed to allocate %d bytes for the Patch File\n", patch_size);
            goto free_mem_and_ret;
        }

        updater_spi_flash_read(patch_offset, patch_buf, patch_size, false);

        // Creating BZLIB streams for decompression
        ret = BZ2_bzDecompressStreamInit(&ctrl_strm, (char *)patch_buf + 32, bzctrllen);
        if (ret != BZ_OK) {
            ESP_LOGE(TAG, "Failed to init stream for CTRL block. Error code: %d\n", ret);
            goto free_mem_and_ret;
        }
        ret = BZ2_bzDecompressStreamInit(&diff_strm, (char *)patch_buf + 32 + bzctrllen, bzdatalen);
        if (ret != BZ_OK) {
            ESP_LOGE(TAG, "Failed to init stream for DIFF block. Error code: %d\n", ret);
            goto free_mem_and_ret;
        }
        ret = BZ2_bzDecompressStreamInit(&xtra_strm, (char *)patch_buf + 32 + bzctrllen + bzdatalen, xtralen);
        if (ret != BZ_OK) {
            ESP_LOGE(TAG, "Failed to init stream for EXTRA block. Error code: %d\n", ret);
            goto free_mem_and_ret;
        }

        // Memory for the buffer to store the decompressed blocks
        int avail_mem = 100 * 1024;

        ESP_LOGD(TAG, "Going to allocate memory for decompressed blocks buffer: %d\n", avail_mem);
        out_buf = heap_caps_malloc(avail_mem, MALLOC_CAP_SPIRAM);

        if (out_buf == NULL) {
            ESP_LOGE(TAG, "Failed to allocate the buffer memory of size %d\n", avail_mem);
            goto free_mem_and_ret;
        }

        // Starting the patching

        // Initializing the parameters of the updater so that the next write is
        // done from the start of the partition
        if (!updater_start()) {
            ESP_LOGE(TAG, "Failed to START UPDATER\n");
            goto free_mem_and_ret;
        }

        while (newpos < newsize) {
            unsigned int byte_count = 0;

            // Reading the control data
            for (i = 0; i <= 2; i++) {
                ctrl_len = 8;
                ret = BZ2_bzDecompressRead(ctrl_strm, (char *)buf, &ctrl_len);
                if (ret != BZ_OK || ctrl_len != 8) {
                    ESP_LOGE(TAG, "PATCHING: Unable to decompress required bytes. ctrl_len: %d\n", ctrl_len);
                    goto free_mem_and_ret;
                }

                ctrl[i] = offtin(buf);
            }

            // Sanity-check
            if (newpos + ctrl[0] > newsize) {
                ESP_LOGE(TAG, "PATCHING: Corrupt Patch. Violated newsize: %d\n", newsize);
                goto free_mem_and_ret;
            }

            // Decompressing ctrl[0] bytes of diff block
            if (ctrl[0] > avail_mem) {
                ESP_LOGE(TAG, "PATCHING: ctrl[0] greater than available memory. ctrl[0]: %d\n", ctrl[0]);
                goto free_mem_and_ret;
            }

            diff_len = ctrl[0];
            ret = BZ2_bzDecompressRead(diff_strm, (char *)out_buf, &diff_len);

            if (ret != BZ_OK || diff_len != ctrl[0]) {
                ESP_LOGE(TAG, "PATCHING: Unable to decompress required bytes. ctrl[0]: %d, diff_len: %d\n", ctrl[0], diff_len);
                goto free_mem_and_ret;
            }
            diff_ptr = out_buf;

            // Reading old binary file in chunks combining it with the Diff
            // bytes
            do {
                int bytes_to_read = 0;

