salal-m/pycom-micropython-sigfox/esp32/ftp/updater.c
                if ((ctrl[0] - byte_count) > FLASH_READ_WRITE_SIZE) {
                    bytes_to_read = FLASH_READ_WRITE_SIZE;
                } else {
                    bytes_to_read = ctrl[0] - byte_count;
                }

                if (ESP_OK != updater_spi_flash_read(old_bin_offset + oldpos, old_bin_buf, bytes_to_read, false)) {
                    ESP_LOGE(TAG, "Error while reading old bin block\n");
                    goto free_mem_and_ret;
                }

                for (i = 0; i < bytes_to_read; i++) {
                    *(diff_ptr + i) += old_bin_buf[i];
                }

                if (!updater_write(diff_ptr, bytes_to_read)) {
                    ESP_LOGE(TAG, "Failed to write %d bytes to the Flash\n", bytes_to_read);
                    goto free_mem_and_ret;
                }

                diff_ptr += bytes_to_read;
                oldpos += bytes_to_read;
                newpos += bytes_to_read;
                byte_count += bytes_to_read;

            } while (byte_count < ctrl[0]);

            // Sanity-check
            if (newpos + ctrl[1] > newsize) {
                ESP_LOGE(TAG, "PATCHING: Corrupt patch, ctrl[1]: %d violated newsize: %d\n", (int)ctrl[1], (int)newsize);
                goto free_mem_and_ret;
            }

            // Decompressing Extra Bytes of size ctrl[1]
            xtra_len = ctrl[1];
            ret = BZ2_bzDecompressRead(xtra_strm, (char *)out_buf, &xtra_len);

            if (ret != BZ_OK || xtra_len != ctrl[1]) {
                ESP_LOGE(TAG, "PATCHING: Unable to decompress required bytes. ctrl[1]: %d, xtra_len: %d\n", ctrl[1], xtra_len);
                goto free_mem_and_ret;
            }
            xtra_ptr = out_buf;

            // Writing the bytes from the Extra Block
            int write_size = ctrl[1];
            while (write_size > FLASH_READ_WRITE_SIZE) {
                if (!updater_write(xtra_ptr + ctrl[1] - write_size, FLASH_READ_WRITE_SIZE)) {
                    ESP_LOGE(TAG, "Failed to write %d bytes from Extra Block to the Flash\n", FLASH_READ_WRITE_SIZE);
                    goto free_mem_and_ret;
                }
                write_size -= FLASH_READ_WRITE_SIZE;
            }

            if (write_size)
                if (!updater_write(xtra_ptr + ctrl[1] - write_size, write_size)) {
                    ESP_LOGE(TAG, "Failed to write %d bytes from Extra Block to the Flash\n", write_size);
                    goto free_mem_and_ret;
                }

            // Adjust the pointers
            xtra_ptr += ctrl[1];
            newpos += ctrl[1];
            oldpos += ctrl[2];
        }

        ESP_LOGI(TAG, "UPDATER_PATCH: PATCHED: %10d sized file\n", (int)newpos);

        ESP_LOGD(TAG, "UPDATER_PATCH: Old_Offset: %d, Offset: %d, Size: %d, ChunkSize: %d, Chunk: %d\n",
                 old_bin_offset, updater_data.offset, updater_data.size,
                 updater_data.chunk_size, updater_data.current_chunk);

        status = true;
        printf("Patching SUCCESSFUL.\n");

    free_mem_and_ret:
        heap_caps_free(patch_buf);
        heap_caps_free(out_buf);
        if (ctrl_strm) {
            BZ2_bzDecompressStreamEnd(ctrl_strm);
        }
        if (diff_strm) {
            BZ2_bzDecompressStreamEnd(diff_strm);
        }
        if (xtra_strm) {
            BZ2_bzDecompressStreamEnd(xtra_strm);
        }
    }

return_status:
    if (status) {
        // Updating BOOT INFO
        boot_info.PrevImg = boot_info.ActiveImg;

        if (boot_info.ActiveImg == IMG_ACT_UPDATE1) {
            boot_info.ActiveImg = IMG_ACT_UPDATE2;
        } else {
            boot_info.ActiveImg = IMG_ACT_UPDATE1;
        }
        boot_info.Status = IMG_STATUS_CHECK;
    } else {
        // In case of failure we don't change the active image in boot info
        boot_info.Status = IMG_STATUS_CHECK;
    }

    // save the actual boot_info structure to otadata partition
    updater_write_boot_info(&boot_info, boot_info_offset);
    updater_data.offset = 0;

    return status;
}
#endif

bool updater_finish (void) {
    if (updater_data.offset > 0) {
        ESP_LOGI(TAG, "Updater finished, boot status: %d\n", boot_info.Status);
//        sl_LockObjLock (&wlan_LockObj, SL_OS_WAIT_FOREVER);
        // if we still have an image pending for verification, leave the boot info as it is
        if (boot_info.Status != IMG_STATUS_CHECK) {
#ifdef DELTA_UPDATE_ENABLED
            if(updater_is_delta_file()) {
                printf("Found delta image, setting the status to PATCH., BOOT_INFO.SIZE: %d\n", boot_info.size);
                //boot_info.patch_size = boot_info.size;
                boot_info.Status = IMG_STATUS_PATCH;
                updater_write_boot_info(&boot_info, boot_info_offset);

            }else 
#endif
            {
                ESP_LOGI(TAG, "Saving new boot info\n");
                // save the new boot info
                boot_info.PrevImg = boot_info.ActiveImg;
                if (boot_info.ActiveImg == IMG_ACT_UPDATE1) {
                    boot_info.ActiveImg = IMG_ACT_UPDATE2;
                } else {
                    boot_info.ActiveImg = IMG_ACT_UPDATE1;
                }
                boot_info.Status = IMG_STATUS_CHECK;

                // save the actual boot_info structure to otadata partition
                updater_write_boot_info(&boot_info, boot_info_offset);
            }
        }
//        sl_LockObjUnlock (&wlan_LockObj);
        updater_data.offset = 0;
    }
//    sl_LockObjUnlock (&updater_LockObj);
    return true;
}

bool updater_verify (void) {
    // bootloader verifies anyway the image, but the user can check himself
    // so, the next code is adapted from bootloader/bootloader.c,

    // the last image written stats at updater_data.offset_start_upd and
    // has the lenght boot_info.size

    esp_err_t ret;
    esp_image_metadata_t data;
    const esp_partition_pos_t part_pos = {
      .offset = updater_data.offset_start_upd,
      .size = boot_info.size,
    };

    ret = esp_image_verify(ESP_IMAGE_VERIFY, &part_pos, &data);

    ESP_LOGI(TAG, "esp_image_verify: %d\n", ret);

    return (ret == ESP_OK);
}


bool updater_write_boot_info(boot_info_t *boot_info, uint32_t boot_info_offset) {

    boot_info->crc = crc32_le(UINT32_MAX, (uint8_t *)boot_info, sizeof(boot_info_t) - sizeof(boot_info->crc));
    ESP_LOGI(TAG, "Wr crc=0x%x\n", boot_info->crc);

    if (ESP_OK != spi_flash_erase_sector(boot_info_offset / SPI_FLASH_SEC_SIZE)) {
        printf("Erasing boot info failed\n");
        return false;
    }

    // saving boot info, encrypted
    esp_err_t ret; // return code of the flash_write operation
    if (esp_flash_encryption_enabled()) {
        // sizeof(boot_info_t) is 40 bytes, and we have to write multiple of 16
        // so read next 48-40 bytes from flash, and write back 48 B

        uint32_t len_aligned_16 = ((sizeof(boot_info_t) + 15) / 16) * 16;
        uint8_t *buff; // buffer used for filling boot_info data
        buff = (uint8_t *)malloc(len_aligned_16);

        if (!buff) {
            ESP_LOGE(TAG, "Can't allocate %d\n", len_aligned_16);
            return false;
        }

        // put the first sizeof(boot_info_t)
        memcpy(buff, (void *)boot_info, sizeof(boot_info_t));

        // read the next bytes
        spi_flash_read_encrypted(boot_info_offset + sizeof(boot_info_t),
                                (void *)(buff + sizeof(boot_info_t)),
                                len_aligned_16 - sizeof(boot_info_t) );

